[
  {
    "image": "https://play-lh.googleusercontent.com/plDBa2_T3j3Sqd5I0R0-A22zTGR8p--_3t0qjHjgM9hrS5-w4sY-h_pe7w-U--b4DqM",
    "title": "Nova Launcher",
    "companyName": "TeslaCoil Apps",
    "id": 1,
    "description": "Nova Launcher is a powerful, customizable, and versatile home screen replacement that has been a favorite in the Android community for years. It offers a perfect balance between incredible performance and high-level personalization, allowing you to transform your device to match your taste and workflow. Dive deep into a vast array of features including custom icon themes, which let you change the look of all your app icons instantly. Utilize subgrid positioning to snap icons or widgets precisely where you want them, breaking free from the rigid grid. Advanced gesture controls allow you to set up shortcuts for swiping, pinching, or double-tapping on the screen. Organize your app drawer with custom tabs, vertical or horizontal scrolling, and custom effects. Nova is built for performance, ensuring your experience is smooth, fast, and responsive, even on older devices. It's the ultimate tool for anyone looking to truly personalize their Android experience.",
    "size": 25,
    "reviews": 1450320,
    "ratingAvg": 4.5,
    "downloads": 50,
    "ratings": [
      { "name": "1 star", "count": 50110 },
      { "name": "2 star", "count": 28990 },
      { "name": "3 star", "count": 87050 },
      { "name": "4 star", "count": 250120 },
      { "name": "5 star", "count": 1034050 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/39gN-2m5t637v9T4s7u5j3Iu_H3-2N-2_RdP0-iIuun6_s2cCFjBwFVnE83a-k-y7_lB",
    "title": "Sync Pro for Reddit",
    "companyName": "Relay for Reddit",
    "id": 2,
    "description": "Sync for Reddit (previously known as Reddit Sync) is a full-featured app designed for an unparalleled experience browsing the popular site Reddit on the go. It’s built from the ground up for speed and usability, featuring a gorgeous Material Design interface that is both beautiful and intuitive. Enjoy a secure login, subreddit synchronization, and multi-account support to effortlessly switch between your profiles. The app boasts advanced features like a customizable interface with a stunning night theme, inline image previews for quick viewing, and comprehensive moderator tools for managing your communities effectively. It also supports multiple content views, including cards, lists, and image-focused galleries, catering to every type of Redditor. With powerful comment navigation, gesture-based controls, and spoiler support, Sync Pro provides a truly premium Reddit experience. It’s the definitive choice for enthusiasts who demand power, speed, and a clean, modern design for their daily browsing.",
    "size": 89,
    "reviews": 85230,
    "ratingAvg": 4.8,
    "downloads": 1,
    "ratings": [
      { "name": "1 star", "count": 1200 },
      { "name": "2 star", "count": 850 },
      { "name": "3 star", "count": 2100 },
      { "name": "4 star", "count": 15800 },
      { "name": "5 star", "count": 65280 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/h5T2n82uEyn2wc6u-362y4htwQ4d-58xVe9kI9-1_y0f0o3tSFTJYw2aQ-w-2u2jwrY",
    "title": "Pocket Casts",
    "companyName": "Automattic",
    "id": 3,
    "description": "Pocket Casts is the world's most powerful podcast platform, meticulously crafted by listeners, for listeners. This app provides a top-tier listening, search, and discovery experience. Find your next obsession with our hand-curated podcast recommendations for easy discovery. Enjoy features like cross-device syncing of playback progress, custom filters to organize your episodes, and variable speed playback to listen at your own pace. Trim Silence intelligently removes pauses from episodes, saving you hours over time. The app offers a beautiful, easy-to-use interface with both light and dark themes, ensuring a comfortable experience day or night. With powerful search tools, you can find not just podcasts but individual episodes by title or show notes. Whether you're a seasoned podcast veteran or just getting started, Pocket Casts offers a robust and delightful platform to manage and enjoy your favorite shows, making it an essential download.",
    "size": 45,
    "reviews": 180400,
    "ratingAvg": 4.1,
    "downloads": 5,
    "ratings": [
      { "name": "1 star", "count": 15000 },
      { "name": "2 star", "count": 7800 },
      { "name": "3 star", "count": 19600 },
      { "name": "4 star", "count": 38000 },
      { "name": "5 star", "count": 100000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/7p-hP-YUG2EmOkM9m-Cx5DFlw-llh-I4t-O-lJp_gYKb-9lE5n-pI57-m-2Vb-4yEaQ",
    "title": "Solid Explorer",
    "companyName": "NeatBytes",
    "id": 4,
    "description": "Solid Explorer is a sophisticated file management app inspired by the classic file commander applications. It will help you easily manage all your files with its intuitive dual-pane layout, which allows for seamless drag-and-drop functionality between panels. Beyond local file management, it offers robust support for cloud storage providers like Google Drive, Dropbox, and OneDrive, letting you manage your cloud files as if they were on your device. It also supports major network protocols such as FTP, SFTP, and SMB/CIFS. The app ensures your privacy with strong AES encryption, allowing you to protect sensitive files and folders with a password or fingerprint. With a rich set of customization options, a sleek Material Design interface, and powerful tools for archiving (ZIP, 7ZIP, RAR, TAR), Solid Explorer is the ultimate solution for organizing your digital life efficiently and securely on your Android device.",
    "size": 32,
    "reviews": 215600,
    "ratingAvg": 4.4,
    "downloads": 5,
    "ratings": [
      { "name": "1 star", "count": 11000 },
      { "name": "2 star", "count": 5600 },
      { "name": "3 star", "count": 16000 },
      { "name": "4 star", "count": 48000 },
      { "name": "5 star", "count": 135000 }
    ]
  },
  {
    "image": "https://tasker.joaoapps.com/tasker_logo_white.png",
    "title": "Tasker",
    "companyName": "joaomgcd",
    "id": 5,
    "description": "Tasker enables total automation for your Android device, from individual settings to complex chains of actions. It allows you to trigger actions based on a wide variety of contexts, such as the app you're in, the time of day, your current location, your Wi-Fi network, received SMS or calls, and much more. With its powerful system, you can create custom tasks that automate things you do every day. For example, automatically silence your phone at work, launch your music app when you connect headphones, or send a custom reply to a text while you're driving. With over 350 built-in actions and support for third-party plugins, the possibilities are virtually endless. While it has a learning curve, Tasker is the undisputed champion of Android automation for power users, developers, and hobbyists who want to make their smart device truly intelligent and responsive to their needs.",
    "size": 18,
    "reviews": 75900,
    "ratingAvg": 4.6,
    "downloads": 1,
    "ratings": [
      { "name": "1 star", "count": 2100 },
      { "name": "2 star", "count": 1500 },
      { "name": "3 star", "count": 3300 },
      { "name": "4 star", "count": 14000 },
      { "name": "5 star", "count": 55000 }
    ]
  },
  {
    "image": "https://cdn.arstechnica.net/wp-content/uploads/2016/10/weather-timeline.png",
    "title": "Weather Timeline",
    "companyName": "Sam Ruston",
    "id": 6,
    "description": "Weather Timeline was a simple, elegant weather app acclaimed for its focus on summarizing the next hour, the next 48 hours, and the next week in a clean, color-coded timeline. This approach made it incredibly easy to visualize the forecast at a glance. The app's signature feature was its timeline forecast, which presented temperature, precipitation, and wind information in a digestible format. It also featured a beautiful and minimalist design that was highly customizable, allowing users to choose from various themes and data sources. The app included a time machine feature, letting you check historical weather data or forecasts for future dates. With its detailed radar maps, severe weather alerts, and multiple stylish widget options, Weather Timeline was celebrated for its accuracy and aesthetic appeal. It provided a powerful and visually pleasing way for users to stay informed about the weather conditions that matter most to them.",
    "size": 55,
    "reviews": 92300,
    "ratingAvg": 4.7,
    "downloads": 1,
    "ratings": [
      { "name": "1 star", "count": 1800 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 2600 },
      { "name": "4 star", "count": 17000 },
      { "name": "5 star", "count": 70000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Google_Keep_icon_%282020%29.svg/512px-Google_Keep_icon_%282020%29.svg.png",
    "title": "Google Keep",
    "companyName": "Google LLC",
    "id": 7,
    "description": "Quickly capture what's on your mind with Google Keep, the essential tool for notes, lists, and reminders. Get a reminder later at the right place or time, ensuring you never miss a thing. Speak a voice memo on the go and have it automatically transcribed for easy reference. You can also grab a photo of a poster, receipt, or document and easily organize or find it later in search. Google Keep makes it easy to capture a thought or list for yourself, and share it with friends and family. Organize your notes with color-coded labels, create checklists for tasks, and set location-based reminders, like pulling up your grocery list right when you get to the store. Everything you add syncs seamlessly across all your devices—phone, tablet, and computer—so your thoughts are always with you.",
    "size": 22,
    "reviews": 2500000,
    "ratingAvg": 4.3,
    "downloads": 1000,
    "ratings": [
      { "name": "1 star", "count": 150000 },
      { "name": "2 star", "count": 75000 },
      { "name": "3 star", "count": 225000 },
      { "name": "4 star", "count": 550000 },
      { "name": "5 star", "count": 1500000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Canva_icon_2021.svg/512px-Canva_icon_2021.svg.png",
    "title": "Canva",
    "companyName": "Canva",
    "id": 8,
    "description": "Canva makes graphic design and video editing incredibly simple and fun, empowering everyone to create professional-quality visuals. Create stunning logo designs, posters, social media posts, and videos with your own photos and videos—even if you’re not a design expert! Choose from thousands of free, professionally designed templates and customize them with just a few taps. The app features an intuitive drag-and-drop editor that makes it easy to add, edit, and arrange text, graphics, and images. Explore a massive library of stock photos, illustrations, icons, and fonts to bring your ideas to life. Whether you are creating an Instagram story, a business presentation, or a birthday invitation, Canva’s versatile tools and vast content library provide everything you need. Collaborate with your team in real-time and export your designs in high resolution. It's the all-in-one design tool for your creative projects, both big and small.",
    "size": 28,
    "reviews": 11200000,
    "ratingAvg": 4.7,
    "downloads": 100,
    "ratings": [
      { "name": "1 star", "count": 250000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 1400000 },
      { "name": "5 star", "count": 9000000 }
    ]
  },
  {
    "image": "https://seeklogo.com/images/S/strava-logo-C4A1127B31-seeklogo.com.png",
    "title": "Strava",
    "companyName": "Strava Inc.",
    "id": 9,
    "description": "Track your fitness activity with Strava, the leading social network for athletes. Record your run, map a cycling route, or track a hike, and analyze your training with all the stats – for free! Strava turns every phone into a sophisticated running and cycling computer. Start Strava before an activity and you can track your favorite performance stats, and then dive deep into your data afterwards. The app connects you with a global community of athletes, allowing you to share your activities, compete on leaderboards for trail segments, and follow your friends' progress. Discover new routes, join monthly challenges to push yourself, and get kudos from your peers for your accomplishments. Whether you're training for a marathon, cycling for fun, or just love to explore the outdoors, Strava provides the tools and motivation you need to stay active and reach your fitness goals.",
    "size": 95,
    "reviews": 2100000,
    "ratingAvg": 4.4,
    "downloads": 50,
    "ratings": [
      { "name": "1 star", "count": 110000 },
      { "name": "2 star", "count": 60000 },
      { "name": "3 star", "count": 180000 },
      { "name": "4 star", "count": 450000 },
      { "name": "5 star", "count": 1300000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Bitwarden_Logo.svg/512px-Bitwarden_Logo.svg.png",
    "title": "Bitwarden",
    "companyName": "Bitwarden Inc.",
    "id": 10,
    "description": "Bitwarden is the easiest and safest way to store all of your logins and passwords while conveniently keeping them synced between all your devices. It is a free and open-source password manager that helps you create strong, unique passwords for every account you have online. Your private data is protected with end-to-end AES-256 bit encryption, ensuring that only you have access to your information. The app includes a secure password generator to help you fortify your accounts against threats. With its browser extensions and mobile apps, Bitwarden can autofill your credentials for a seamless login experience. Beyond passwords, you can securely store credit cards, identity documents, and secure notes. Bitwarden provides a transparent, trusted solution for password management, making it an essential tool for anyone serious about their online security in today's digital world.",
    "size": 65,
    "reviews": 140000,
    "ratingAvg": 4.7,
    "downloads": 10,
    "ratings": [
      { "name": "1 star", "count": 3000 },
      { "name": "2 star", "count": 1500 },
      { "name": "3 star", "count": 4500 },
      { "name": "4 star", "count": 21000 },
      { "name": "5 star", "count": 110000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/53/Signal-Logo.svg/512px-Signal-Logo.svg.png",
    "title": "Signal",
    "companyName": "Signal Foundation",
    "id": 11,
    "description": "Millions of people use Signal every day for free and instantaneous communication anywhere in the world. Send and receive high-fidelity messages, participate in HD voice/video calls, and explore a growing set of new features that help you stay connected. Signal’s advanced privacy-preserving technology is always enabled, so you can focus on sharing the moments that matter with the people who matter to you. The platform is renowned for its state-of-the-art end-to-end encryption, powered by the open-source Signal Protocol, which keeps your conversations secure. As an independent nonprofit organization, Signal is not tied to any major tech companies and can never be acquired. Development is supported by users around the world, ensuring a focus on privacy and user experience above all else. For truly private messaging, Signal is the industry standard.",
    "size": 75,
    "reviews": 1600000,
    "ratingAvg": 4.5,
    "downloads": 100,
    "ratings": [
      { "name": "1 star", "count": 70000 },
      { "name": "2 star", "count": 40000 },
      { "name": "3 star", "count": 90000 },
      { "name": "4 star", "count": 300000 },
      { "name": "5 star", "count": 1100000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/s6nDAWRqg4MODunxOdJ1H-A0a-s-x-b-l-s-1z-2-4y-7-8j-6_c-3-5s-9-0",
    "title": "InShot",
    "companyName": "InShot Inc.",
    "id": 12,
    "description": "InShot is a powerful and user-friendly all-in-one Video Editor and Video Maker packed with professional features. It's designed to make video editing accessible to everyone, from beginners to social media content creators. Easily trim and cut videos, merge clips, and adjust video speed for slow-motion or fast-motion effects. Add your own music, sound effects, or voice-overs to enhance your creations. The app includes a vast library of transition effects, text styles, animated stickers, and filters to give your videos a polished, professional look. You can also blur the background, create photo collages, and edit photos with its built-in photo editor. InShot is perfect for creating content for YouTube, Instagram, TikTok, and other platforms, with easy-to-use canvas and aspect ratio settings. It provides all the essential tools you need to craft compelling visual stories right from your phone.",
    "size": 120,
    "reviews": 15000000,
    "ratingAvg": 4.8,
    "downloads": 500,
    "ratings": [
      { "name": "1 star", "count": 180000 },
      { "name": "2 star", "count": 120000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 1400000 },
      { "name": "5 star", "count": 13000000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Duolingo_logo.svg/600px-Duolingo_logo.svg.png",
    "title": "Duolingo",
    "companyName": "Duolingo",
    "id": 13,
    "description": "Learn a new language with the world’s most-downloaded education app! Duolingo is the fun, free app for learning over 40 languages through quick, bite-sized lessons. Practice speaking, reading, listening, and writing to build your vocabulary and grammar skills. Designed by language experts and loved by hundreds of millions of learners worldwide, Duolingo helps you prepare for real conversations in Spanish, French, Chinese, Italian, German, English, and more. The app uses a gamified approach, with points, streaks, and rewards to keep you motivated. Whether you’re learning a language for travel, school, career, family and friends, or your brain health, you’ll love learning with Duolingo. Each lesson feels like a game, making the learning process engaging and effective. It's a convenient and accessible way to build a solid foundation in a new language, one small step at a time.",
    "size": 58,
    "reviews": 16200000,
    "ratingAvg": 4.7,
    "downloads": 500,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 600000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 13000000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Notion-logo.svg/512px-Notion-logo.svg.png",
    "title": "Notion",
    "companyName": "Notion Labs, Inc.",
    "id": 14,
    "description": "Write, plan, and get organized with Notion, the all-in-one workspace that combines notes, tasks, wikis, and databases into a single, flexible platform. Unlike traditional tools, Notion allows you to build and customize your own systems for productivity. Use it as a simple note-taking app, a complex project management tool, a personal wiki, or a collaborative team hub. The app's power lies in its building blocks: create pages and embed databases, Kanban boards, calendars, and lists within them. This flexibility makes it ideal for a wide range of uses, from managing personal goals and academic research to coordinating entire company roadmaps. With real-time collaboration and seamless syncing across all devices, your information is always accessible and up-to-date. Notion adapts to your needs, providing a clean and powerful space for you and your team to think, write, and plan with clarity.",
    "size": 35,
    "reviews": 245000,
    "ratingAvg": 3.8,
    "downloads": 10,
    "ratings": [
      { "name": "1 star", "count": 30000 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 35000 },
      { "name": "4 star", "count": 65000 },
      { "name": "5 star", "count": 100000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/VLC_Icon.svg/512px-VLC_Icon.svg.png",
    "title": "VLC for Android",
    "companyName": "Videolabs",
    "id": 15,
    "description": "VLC media player is a free and open-source cross-platform multimedia player that plays most multimedia files as well as discs, devices, and network streaming protocols. The Android version brings the power and versatility of the desktop classic to your mobile device. It plays virtually any video or audio file you throw at it, without the need for additional codecs. The app features a full media library with search and history, allowing you to easily browse your audio and video files. It supports advanced features like multi-track audio, subtitles (including external files), and aspect-ratio adjustments. You can stream media directly from network shares, such as SMB or FTP, or from URLs. With gesture controls for volume and brightness, an audio equalizer, and support for Chromecast, VLC for Android is the ultimate do-it-all media player for your phone or tablet.",
    "size": 40,
    "reviews": 1800000,
    "ratingAvg": 4.3,
    "downloads": 100,
    "ratings": [
      { "name": "1 star", "count": 110000 },
      { "name": "2 star", "count": 60000 },
      { "name": "3 star", "count": 130000 },
      { "name": "4 star", "count": 300000 },
      { "name": "5 star", "count": 1200000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/Shazam_icon.svg/512px-Shazam_icon.svg.png",
    "title": "Shazam",
    "companyName": "Apple Inc.",
    "id": 16,
    "description": "Shazam is the magical app that identifies any song in seconds. Discover artists, lyrics, videos, and playlists, all for free. With over 1 billion installs and counting, it has become the definitive tool for music discovery. Just tap the Shazam button to instantly identify what's playing around you, even from other apps or with headphones on. Once a song is identified, you can access its lyrics, watch the music video, and listen to it on your favorite music streaming services like Apple Music or Spotify. The app keeps a history of all your Shazams, allowing you to rediscover old favorites. You can also follow top artists to see what they’re Shazaming and get curated playlists. Whether you're in a cafe, watching a movie, or listening to the radio, Shazam ensures you'll never have to wonder about the name of that song again.",
    "size": 15,
    "reviews": 7500000,
    "ratingAvg": 4.8,
    "downloads": 500,
    "ratings": [
      { "name": "1 star", "count": 80000 },
      { "name": "2 star", "count": 70000 },
      { "name": "3 star", "count": 150000 },
      { "name": "4 star", "count": 700000 },
      { "name": "5 star", "count": 6500000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/53/Picsart_Logo.svg/512px-Picsart_Logo.svg.png",
    "title": "Picsart",
    "companyName": "PicsArt, Inc.",
    "id": 17,
    "description": "Picsart is the best all-in-one photo and video editor on mobile, designed to unleash your creativity. With one of the most popular apps, boasting over 1 billion downloads to date, you can bring your artistic vision to life. The app offers a comprehensive suite of editing tools, from basic adjustments like cropping and resizing to advanced features like a background remover, object removal, and professional-style filters. Create stunning collages with a variety of grid layouts, or design from scratch with powerful drawing tools and customizable brushes. The video editor makes it easy to add music, trim clips, and apply trendy effects. Dive into a massive collection of stickers, fonts, and templates created by the Picsart community. Whether you're touching up a selfie, designing a social media post, or creating digital art, Picsart provides everything you need in one convenient, intuitive platform.",
    "size": 88,
    "reviews": 12000000,
    "ratingAvg": 4.2,
    "downloads": 500,
    "ratings": [
      { "name": "1 star", "count": 900000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 1900000 },
      { "name": "5 star", "count": 8000000 }
    ]
  },
  {
    "image": "https://logowik.com/content/uploads/images/zenly-app4921.jpg",
    "title": "Zenly",
    "companyName": "Zenly",
    "id": 18,
    "description": "Zenly was the beloved social app that mapped your world, helping you connect with friends and family in a fun and visual way. It allowed you to see your friends' real-time locations on a map, making it easy to meet up and see who was nearby. The app was more than just a location tracker; it was a social hub. You could see your friends' battery levels, how long they've been at a certain place, and even send them fun emojis and messages. Zenly created a personal map of your life, showing the places you visited most and the people you spent time with. Features like the 'fog of war' encouraged exploration by revealing parts of the map you had visited. It was designed to foster real-life connections by reducing the friction of planning get-togethers. Zenly was celebrated for its playful interface and its unique ability to bring people closer together.",
    "size": 77,
    "reviews": 3400000,
    "ratingAvg": 4.6,
    "downloads": 100,
    "ratings": [
      { "name": "1 star", "count": 150000 },
      { "name": "2 star", "count": 80000 },
      { "name": "3 star", "count": 220000 },
      { "name": "4 star", "count": 550000 },
      { "name": "5 star", "count": 2400000 }
    ]
  },
  {
    "image": "https://cdn-assets.alltrails.com/assets/apple-touch-icon-180x180-1-1692131229.png",
    "title": "AllTrails",
    "companyName": "AllTrails, LLC",
    "id": 19,
    "description": "Explore the outdoors with AllTrails, your guide to adventure. Discover nature with over 300,000 curated hiking, biking, backpacking, and running trails around the world. Log your hike, walk, run, or mountain bike ride with our GPS activity tracker. View your stats at a glance and share your outdoor adventures with friends. The app allows you to filter trails by difficulty, length, and suitability for dogs or kids, ensuring you find the perfect path for your outing. Read reviews and see photos from a community of millions of fellow hikers, bikers, and trail runners. With a Pro subscription, you can download offline maps to stay on track even without a signal, get off-route notifications, and use Lifeline to keep your loved ones informed of your location. Whether you're looking for a local park or a national park epic, AllTrails helps you find your way outside.",
    "size": 110,
    "reviews": 320000,
    "ratingAvg": 4.8,
    "downloads": 10,
    "ratings": [
      { "name": "1 star", "count": 4000 },
      { "name": "2 star", "count": 2000 },
      { "name": "3 star", "count": 6000 },
      { "name": "4 star", "count": 28000 },
      { "name": "5 star", "count": 280000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Musixmatch_logo.svg/512px-Musixmatch_logo.svg.png",
    "title": "Musixmatch",
    "companyName": "Musixmatch",
    "id": 20,
    "description": "Musixmatch features the world’s largest collection of song lyrics, used by millions of people to get instant time-synced lyrics for services like Youtube, Spotify, Pandora, and more. With its FloatingLyrics feature, you can enjoy synchronized lyrics while listening to your favorite songs on your preferred music app. It's the perfect companion for sing-alongs, learning new songs, or understanding lyrics in a foreign language. The app can also identify music playing around you with a single tap, providing the lyrics on the spot. You can search for your favorite song by title, artist, or even just a single line of the lyrics. Contribute to the community by translating lyrics into different languages and help make the catalog even better. With a sleek interface and powerful integration, Musixmatch enriches your music listening experience by connecting you more deeply with the words behind the music.",
    "size": 63,
    "reviews": 2200000,
    "ratingAvg": 4.4,
    "downloads": 50,
    "ratings": [
      { "name": "1 star", "count": 130000 },
      { "name": "2 star", "count": 70000 },
      { "name": "3 star", "count": 150000 },
      { "name": "4 star", "count": 350000 },
      { "name": "5 star", "count": 1500000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Zomato_logo.png/512px-Zomato_logo.png",
    "title": "Zomato",
    "companyName": "Zomato",
    "id": 21,
    "description": "Zomato is your one-stop app for restaurant discovery and food delivery. Whether you're looking for biryani to feed your desi cravings, soul-comforting pizzas and burgers, or even a healthy salad, Zomato is the only app you need to find the best options around you. Browse through thousands of restaurant menus, photos, user reviews, and ratings to decide where you want to eat. Use the map view to explore restaurants nearby or search for specific cuisines or dishes. The app provides a seamless online ordering experience, allowing you to get your favorite food delivered right to your doorstep with real-time tracking. You can also book a table in advance to avoid waiting times. With great deals and offers from partner restaurants, Zomato not only helps you discover great food but also saves you money. It's the ultimate companion for every foodie.",
    "size": 42,
    "reviews": 4500000,
    "ratingAvg": 4.1,
    "downloads": 100,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 800000 },
      { "name": "5 star", "count": 2700000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/6Xy15s_YlKwnx6n-G-7-T-d-c-s-3a-2s-1b-5-8g-7-9-6-y-4-3-1z-2",
    "title": "Sleep Cycle",
    "companyName": "Sleep Cycle AB",
    "id": 22,
    "description": "Relax, sleep better, and wake up feeling rested with Sleep Cycle, the smart alarm clock and sleep tracker. The app analyzes your sleep patterns by monitoring your sounds and movements during the night. It then wakes you up during your lightest sleep phase within a customized 30-minute window, which helps you feel refreshed and energized instead of groggy. Track your sleep from bedtime to morning and get a detailed analysis of your sleep quality, including statistics on deep sleep, time in bed, and trends over time. The app also features a library of sleep sounds, stories, and relaxation guides to help you fall asleep faster. Its smart alarm clock function is designed to make your mornings easier. By understanding your sleep cycles, the app provides valuable insights to help you improve your sleep habits and overall well-being over the long term.",
    "size": 98,
    "reviews": 550000,
    "ratingAvg": 4.5,
    "downloads": 10,
    "ratings": [
      { "name": "1 star", "count": 25000 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 40000 },
      { "name": "4 star", "count": 110000 },
      { "name": "5 star", "count": 360000 }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/yFIIiY9gO95yL04t-i_TJCk8V3RDUJqfDb-E-3k-C-s-l-1z-3r-5-8t-2-4g",
    "title": "Moon+ Reader",
    "companyName": "Moon+",
    "id": 23,
    "description": "Moon+ Reader is a professionally designed book reader with powerful controls and full functions. It supports a wide range of ebook formats, including EPUB, PDF, MOBI, CHM, CBR, CBZ, and more. The app offers a highly customizable reading experience with over 10 embedded themes, day and night mode switcher, and various visual options like line space, font scale, and justification alignment. Enjoy a smooth, realistic page-turning effect or customize it to your liking. The app includes intelligent paragraph indentation, trimming of unwanted white spaces, and support for syncing reading positions via Dropbox. It also features a 'Keep your eyes health' option for long reading sessions and highlights, annotations, and dictionary support. With its comprehensive feature set and extensive format compatibility, Moon+ Reader is the perfect application for any avid reader looking for a powerful and personalized reading experience on their device.",
    "size": 29,
    "reviews": 430000,
    "ratingAvg": 4.6,
    "downloads": 10,
    "ratings": [
      { "name": "1 star", "count": 12000 },
      { "name": "2 star", "count": 8000 },
      { "name": "3 star", "count": 20000 },
      { "name": "4 star", "count": 80000 },
      { "name": "5 star", "count": 310000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/8/87/Calm_logo.png/440px-Calm_logo.png",
    "title": "Calm",
    "companyName": "Calm.com, Inc.",
    "id": 24,
    "description": "Calm is the #1 app for sleep, meditation, and relaxation. Discover a happier, healthier you through our guided meditations, Sleep Stories, breathing programs, masterclasses, and relaxing music. Recommended by top psychologists, therapists, and mental health experts, Calm is the perfect mindfulness app for beginners, but also includes hundreds of programs for intermediate and advanced users. Guided meditation sessions are available in lengths of 3, 5, 10, 15, 20 or 25 minutes so you can choose the perfect length to fit with your schedule. Topics include calming anxiety, managing stress, deep sleep, focus, and concentration. The app also features Sleep Stories, which are soothing tales read by well-known voices to help you drift off to sleep. Whether you need to reduce stress, get better rest, or improve your focus, Calm provides the tools to help you find your inner peace.",
    "size": 85,
    "reviews": 1100000,
    "ratingAvg": 4.3,
    "downloads": 50,
    "ratings": [
      { "name": "1 star", "count": 70000 },
      { "name": "2 star", "count": 40000 },
      { "name": "3 star", "count": 90000 },
      { "name": "4 star", "count": 200000 },
      { "name": "5 star", "count": 700000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/1Password_Icon.svg/512px-1Password_Icon.svg.png",
    "title": "1Password",
    "companyName": "AgileBits",
    "id": 25,
    "description": "1Password is the password manager that remembers all your passwords for you and keeps them safe and secure behind the one password that only you know. It's a beautiful, simple, and secure way to manage your digital life. With 1Password, you only ever need to memorize one password. All your other passwords and important information are protected by your Master Password, which encrypts your data using authenticated AES-256 encryption. The app can generate strong, unique passwords for all your online accounts, significantly improving your security. It seamlessly integrates with your browser and apps, automatically filling in your credentials for you. Beyond just passwords, you can store credit card details, secure notes, software licenses, and more. With cross-device sync, your information is always available when and where you need it. 1Password is the key to your secure and convenient digital life.",
    "size": 105,
    "reviews": 95000,
    "ratingAvg": 3.9,
    "downloads": 5,
    "ratings": [
      { "name": "1 star", "count": 11000 },
      { "name": "2 star", "count": 5000 },
      { "name": "3 star", "count": 12000 },
      { "name": "4 star", "count": 22000 },
      { "name": "5 star", "count": 45000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Trello-logo-blue.svg/512px-Trello-logo-blue.svg.png",
    "title": "Trello",
    "companyName": "Atlassian",
    "id": 26,
    "description": "Trello is a flexible and visual tool that empowers you and your team to manage any type of project, workflow, or task tracking. Its intuitive system of boards, lists, and cards allows you to organize and prioritize your projects in a fun and rewarding way. A board typically represents a project, while lists represent stages in a workflow (like 'To Do', 'In Progress', 'Done'). Cards, which represent individual tasks, can be moved between lists as they progress. You can add files, checklists, due dates, comments, and labels to cards to keep all relevant information in one place. Invite your team to collaborate, assign tasks, and stay updated on progress with real-time notifications. Whether you're planning a vacation, managing a software development sprint, or organizing a team event, Trello's simple yet powerful interface makes it easy to see who's doing what and what needs to get done.",
    "size": 20,
    "reviews": 150000,
    "ratingAvg": 4.5,
    "downloads": 10,
    "ratings": [
      { "name": "1 star", "count": 6000 },
      { "name": "2 star", "count": 3000 },
      { "name": "3 star", "count": 9000 },
      { "name": "4 star", "count": 32000 },
      { "name": "5 star", "count": 100000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/Snapseed_icon_2020.svg/512px-Snapseed_icon_2020.svg.png",
    "title": "Snapseed",
    "companyName": "Google LLC",
    "id": 27,
    "description": "Snapseed is a complete and professional photo editor developed by Google that brings the power of desktop editing software to your mobile device. It features a comprehensive set of 29 tools and filters, including Healing, Brush, Structure, HDR, and Perspective correction. The app supports non-destructive editing, allowing you to re-adjust your edits at any time. Its intuitive interface uses simple gestures to control powerful tools, such as selective adjustments to enhance specific parts of your photo. You can fine-tune your images with precision, adjusting everything from brightness and contrast to warmth and saturation. Snapseed also opens RAW DNG files, giving professional photographers more flexibility. Save your favorite combinations of edits as 'Looks' to apply them to future photos with a single tap. For anyone serious about mobile photography, Snapseed offers an incredible range of control and quality, all for free.",
    "size": 33,
    "reviews": 1900000,
    "ratingAvg": 4.4,
    "downloads": 100,
    "ratings": [
      { "name": "1 star", "count": 90000 },
      { "name": "2 star", "count": 50000 },
      { "name": "3 star", "count": 130000 },
      { "name": "4 star", "count": 330000 },
      { "name": "5 star", "count": 1300000 }
    ]
  }
]
